/*  Class = "NSButton"; gToolTip = "Delete selected favorite (⌫)"; ObjectID = "17";  */
"Delete selected favorite (⌫)" = "Удалить выбранную закладку (⌫)";

/*  Class = "NSButton"; gToolTip = "Add favorite (⌥⌘A)"; ObjectID = "18";  */
"Add favorite (⌥⌘A)" = "Добавить закладку (⌥⌘A)";

/*  Class = "NSTableColumn"; headerCell.title = "Favorites"; ObjectID = "26";  */
"Favorites" = "Закладки";

/*  Class = "NSTextFieldCell"; title = "Name:"; ObjectID = "122";  */
"Name:" = "Имя:";

/*  Class = "NSTextFieldCell"; placeholderString = "[no selection]"; ObjectID = "124";  */
"[no selection]" = "[не выбрано]";

/*  Class = "NSButtonCell"; title = "Save"; ObjectID = "132";  */
"Save" = "Сохранить";

/*  Class = "NSMenuItem"; title = "Remove"; ObjectID = "206";  */
"Remove" = "Удалить";

/*  Class = "NSMenuItem"; title = "Duplicate"; ObjectID = "212";  */
/*  Class = "NSMenuItem"; title = "Duplicate"; ObjectID = "359";  */
"Duplicate" = "Дублировать";

/*  Class = "NSMenuItem"; gToolTip = "Save query of selected favorite to file"; ObjectID = "365";  */
"Save query of selected favorite to file" = "Сохранить выбранный запрос в файл";

/*  Class = "NSMenuItem"; title = "Save Query to File..."; ObjectID = "365";  */
"Save Query to File..." = "Сохранить запрос в файл...";

/*  Class = "NSMenuItem"; gToolTip = "Remove all favorites"; ObjectID = "367";  */
"Remove all favorites" = "Удалить все закладки";

/*  Class = "NSMenuItem"; title = "Remove All..."; ObjectID = "367";  */
"Remove All..." = "Удалить все…";

/*  Class = "NSMenuItem"; title = "Save to File..."; ObjectID = "248";  */
"Save to File..." = "Сохранить в файл...";

/*  Class = "NSMenuItem"; gToolTip = "Export selected favorites as SPF file"; ObjectID = "361";  */
"Export selected favorites as SPF file" = "Экспортировать выбранные закладки в виде SPF файла";

/*  Class = "NSMenuItem"; title = "Export Selected Favorites…"; ObjectID = "361";  */
"Export Selected Favorites…" = "Экспорт выбранных закладок…";

/*  Class = "NSMenuItem"; gToolTip = "Import query favorites from SPF file and append them to the favorite list"; ObjectID = "363";  */
"Import query favorites from SPF file and append them to the favorite list" = "Импортировать запросы из SPF файла и добавить их в Закладки";

/*  Class = "NSMenuItem"; title = "Import Favorites…"; ObjectID = "363";  */
"Import Favorites…" = "Импорт закладок…";

/*  Class = "NSMenuItem"; gToolTip = "Import query favorites from SPF file and replace the current favorites"; ObjectID = "362";  */
"Import query favorites from SPF file and replace the current favorites" = "Импортировать закладки из SPF файла, заменяя текущие";

/*  Class = "NSMenuItem"; title = "Import Favorites by Replacing…"; ObjectID = "362";  */
"Import Favorites by Replacing…" = "Импортировать с заменой…";

/*  Class = "NSButtonCell"; title = "Cancel"; ObjectID = "272";  */
"Cancel" = "Отменить";

/*  Class = "NSTextFieldCell"; title = "Tab Trigger:"; ObjectID = "307";  */
"Tab Trigger:" = "Псевдоним:";

/*  Class = "NSMenuItem"; title = "Insert Placeholder"; ObjectID = "317";  */
"Insert Placeholder" = "Вставить";

/*  Class = "NSMenuItem"; gToolTip = "${1:default_value} – tab key snippet with a definable default value which will be selected\n\n[“1” can be a number from 0 to 18 and defines the order of tab key down events] "; ObjectID = "318";  */
"${1:default_value} – tab key snippet with a definable default value which will be selected\n\n[“1” can be a number from 0 to 18 and defines the order of tab key down events] " = "${1:default_value} – фрагмент, задающий значение «default_value»\n\n[«1» – номер фрагмента (от 0 до 18), определяющий последовательность переключения между фрагментами по нажатию кнопки ⇥ (Tab)]";

/*  Class = "NSMenuItem"; title = "Tab Snippet"; ObjectID = "318";  */
"Tab Snippet" = "Фрагмент";

/*  Class = "NSMenuItem"; gToolTip = "$(shell_command) – shell_command will be executed and inserts its result\n\n[press ⌘. to cancel the execution of “shell_command”]\n [only available inside of tab snippets] "; ObjectID = "319";  */
"$(shell_command) – shell_command will be executed and inserts its result\n\n[press ⌘. to cancel the execution of “shell_command”]\n [only available inside of tab snippets] " = "$(shell_command) – будет выполнена команда «shell_command», а её вывод подставлен на это место\n\n[чтобы прервать выполнение «shell_command» нажмите «⌘.»]\n [применяется только внутри фрагмента]";

/*  Class = "NSMenuItem"; title = "Tab Snippet and Shell Command"; ObjectID = "319";  */
"Tab Snippet and Shell Command" = "Команда оболочки";

/*  Class = "NSMenuItem"; gToolTip = "$SP_SELECTED_TABLE – will be replaced by the selected table name\n\n[only available inside of tab snippets]"; ObjectID = "321";  */
"$SP_SELECTED_TABLE – will be replaced by the selected table name\n\n[only available inside of tab snippets]" = "$SP_SELECTED_TABLE – будет заменено на имя текущей (выбранной) таблицы\n\n[применяется только внутри фрагмента]";

/*  Class = "NSMenuItem"; title = "Name Of Selected Table"; ObjectID = "321";  */
"Name Of Selected Table" = "Имя текущей таблицы";

/*  Class = "NSMenuItem"; gToolTip = "$SP_SELECTED_TABLES – will be replaced by a comma separated list of all selected table names\n\n[only available inside of tab snippets]"; ObjectID = "322";  */
"$SP_SELECTED_TABLES – will be replaced by a comma separated list of all selected table names\n\n[only available inside of tab snippets]" = "$SP_SELECTED_TABLES – будет заменено на перечисление имён выбранных таблиц через запятую\\n\n[применяется только внутри фрагмента]";

/*  Class = "NSMenuItem"; title = "Name Of Selected Tables"; ObjectID = "322";  */
"Name Of Selected Tables" = "Имена выбранных таблиц";

/*  Class = "NSMenuItem"; gToolTip = "$SP_SELECTED_DATABASE – will be replaced by the selected database name\n\n[only available inside of tab snippets]"; ObjectID = "323";  */
"$SP_SELECTED_DATABASE – will be replaced by the selected database name\n\n[only available inside of tab snippets]" = "$SP_SELECTED_DATABASE – будет заменено на имя текущей базы данных\n\n[применяется только внутри фрагмента]";

/*  Class = "NSMenuItem"; title = "Name Of Selected Database"; ObjectID = "323";  */
"Name Of Selected Database" = "Имя текущей базы данных";

/*  Class = "NSMenuItem"; gToolTip = "¦a¦b¦ – such a snippet will be shown as completion list with the items “a” and “b”\n\n[only available inside of tab snippets]"; ObjectID = "326";  */
"¦a¦b¦ – such a snippet will be shown as completion list with the items “a” and “b”\n\n[only available inside of tab snippets]" = "¦a¦b¦ – перечисление элементов выпадающего списка фрагмента\n\n[применяется только внутри фрагмента]";

/*  Class = "NSMenuItem"; title = "List Template"; ObjectID = "326";  */
"List Template" = "Шаблон списка";

/*  Class = "NSMenuItem"; gToolTip = "¦¦a¦b¦¦ – such a snippet will be shown as completion list with the items “a” and “b” in fuzzy search mode\n\n[only available inside of tab snippets]"; ObjectID = "327";  */
"¦¦a¦b¦¦ – such a snippet will be shown as completion list with the items “a” and “b” in fuzzy search mode\n\n[only available inside of tab snippets]" = "¦¦a¦b¦¦ – перечисление элементов выпадающего списка фрагмента, подгружаемого при необходимости\n\n[применяется только внутри фрагмента]";

/*  Class = "NSMenuItem"; title = "List Template (Fuzzy Search)"; ObjectID = "327";  */
"List Template (Fuzzy Search)" = "Шаблон списка (ленивая загрузка)";

/*  Class = "NSMenuItem"; gToolTip = "¦ – list separator\n\n[only available inside of tab snippets]"; ObjectID = "328";  */
"¦ – list separator\n\n[only available inside of tab snippets]" = "¦ – разделитель списка\n\n[работает только внутри фрагмента]";

/*  Class = "NSMenuItem"; title = "List Separator"; ObjectID = "328";  */
"List Separator" = "Разделитель списка";

/*  Class = "NSMenuItem"; gToolTip = "¦$SP_ASLIST_ALL_DATABASES¦ – such a snippet will be shown as completion list with all database names from the current connection\n\n[only available inside of tab snippets]"; ObjectID = "329";  */
"¦$SP_ASLIST_ALL_DATABASES¦ – such a snippet will be shown as completion list with all database names from the current connection\n\n[only available inside of tab snippets]" = "¦$SP_ASLIST_ALL_DATABASES¦ – формирует выпадающий список баз данных текущего соединения\n\n[применяется только внутри фрагмента]";

/*  Class = "NSMenuItem"; title = "Database Names As List"; ObjectID = "329";  */
"Database Names As List" = "Список баз данных";

/*  Class = "NSMenuItem"; gToolTip = "¦¦$SP_ASLIST_ALL_DATABASES¦¦ – such a snippet will be shown as completion list with all database names from the current connection in fuzzy search mode\n\n[only available inside of tab snippets]"; ObjectID = "330";  */
"¦¦$SP_ASLIST_ALL_DATABASES¦¦ – such a snippet will be shown as completion list with all database names from the current connection in fuzzy search mode\n\n[only available inside of tab snippets]" = "¦¦$SP_ASLIST_ALL_DATABASES¦¦ – формирует выпадающий список баз данных текущего соединения (загрузка данных производится при необходимости)\n\n[применяется только внутри фрагмента]";

/*  Class = "NSMenuItem"; title = "Database Names As List (Fuzzy Search)"; ObjectID = "330";  */
"Database Names As List (Fuzzy Search)" = "Список баз данных (ленивая загрузка)";

/*  Class = "NSMenuItem"; gToolTip = "¦$SP_ASLIST_ALL_TABLES¦ – such a snippet will be shown as completion list with all table names (incl. views) from the current selected database\n\n[only available inside of tab snippets]"; ObjectID = "332";  */
"¦$SP_ASLIST_ALL_TABLES¦ – such a snippet will be shown as completion list with all table names (incl. views) from the current selected database\n\n[only available inside of tab snippets]" = "¦$SP_ASLIST_ALL_TABLES¦ – формирует выпадающий список таблиц (включая представления) текущей (выбранной) базы данных\n\n[применяется только внутри фрагмента]";

/*  Class = "NSMenuItem"; title = "Table Names As List"; ObjectID = "332";  */
"Table Names As List" = "Список таблиц";

/*  Class = "NSMenuItem"; gToolTip = "$1 – mirrored tab snippet which is a placeholder for the content of tab snippet “1”\n\n[“1” can be a number from 0 to 18 and defines the order of tab key down events]\n\n[may not be used inside of a tab snippet] "; ObjectID = "340";  */
"$1 – mirrored tab snippet which is a placeholder for the content of tab snippet “1”\n\n[“1” can be a number from 0 to 18 and defines the order of tab key down events]\n\n[may not be used inside of a tab snippet] " = "$1 – зеркальный фрагмент, подставляющий вместо себя значение фрагмента «1»\n\n[«1» – номер фрагмента (от 0 до 18), определяющий последовательность переключения между фрагментами по нажатию кнопки ⇥ (Tab)]\n\n[может быть использован в любом месте запроса] ";

/*  Class = "NSMenuItem"; title = "Table Names As List (Fuzzy Search)"; ObjectID = "333";  */
"Table Names As List (Fuzzy Search)" = "Список таблиц (ленивая загрузка)";

/*  Class = "NSMenuItem"; gToolTip = "¦$SP_ASLIST_ALL_FIELDS¦ – such a snippet will be shown as completion list with all field names from the current selected table\n\n[only available inside of tab snippets]"; ObjectID = "334";  */
"¦$SP_ASLIST_ALL_FIELDS¦ – such a snippet will be shown as completion list with all field names from the current selected table\n\n[only available inside of tab snippets]" = "¦$SP_ASLIST_ALL_FIELDS¦ – формирует выпадающий список имён полей текущей (выбранной) таблицы \n\n[применяется только внутри фрагмента]";

/*  Class = "NSMenuItem"; title = "Field Names As List of Current Table"; ObjectID = "334";  */
"Field Names As List of Current Table" = "Список полей текущей таблицы";

/*  Class = "NSMenuItem"; gToolTip = "¦¦$SP_ASLIST_ALL_FIELDS¦¦ – such a snippet will be shown as completion list with all field names from the current selected table\n\n[only available inside of tab snippets]"; ObjectID = "335";  */
"¦¦$SP_ASLIST_ALL_FIELDS¦¦ – such a snippet will be shown as completion list with all field names from the current selected table\n\n[only available inside of tab snippets]" = "¦¦$SP_ASLIST_ALL_FIELDS¦¦ – формирует выпадающий список имён полей текущей (выбранной) таблицы (загрузка данных производится при необходимости)\n\n[применяется только внутри фрагмента]";

/*  Class = "NSMenuItem"; title = "Field Names As List of Current Table (Fuzzy Search)"; ObjectID = "335";  */
"Field Names As List of Current Table (Fuzzy Search)" = "Список полей текущей таблицы (ленивая загрузка)";

/*  Class = "NSMenuItem"; title = "Completion Lists:"; ObjectID = "336";  */
"Completion Lists:" = "Динамические списки:";

/*  Class = "NSMenuItem"; title = "⇥ Snippet:"; ObjectID = "337";  */
"⇥ Snippet:" = "⇥ Фрагмент:";

/*  Class = "NSMenuItem"; title = "Completion List:"; ObjectID = "338";  */
"Completion List:" = "Списки:";

/*  Class = "NSMenuItem"; title = "Selection:"; ObjectID = "339";  */
"Selection:" = "Замены:";

/*  Class = "NSMenuItem"; gToolTip = "¦¦$SP_ASLIST_ALL_TABLES¦¦ – such a snippet will be shown as completion list with all table names (incl. views) from the current selected database in fuzzy search mode\n\n[only available inside of tab snippets]"; ObjectID = "333";  */
"¦¦$SP_ASLIST_ALL_TABLES¦¦ – such a snippet will be shown as completion list with all table names (incl. views) from the current selected database in fuzzy search mode\n\n[only available inside of tab snippets]" = "¦¦$SP_ASLIST_ALL_TABLES¦¦ – формирует выпадающий список таблиц (включая представления) текущей (выбранной) базы данных (загрузка данных производится при необходимости)\n\n[применяется только внутри фрагмента]";

/*  Class = "NSMenuItem"; title = "Mirrored Tab Snippet"; ObjectID = "340";  */
"Mirrored Tab Snippet" = "Зеркальный фрагмент";

/*  Class = "NSMenuItem"; title = "Placeholder"; ObjectID = "341";  */
"Placeholder" = "Заполнитель";

/*  Class = "NSTextField"; gToolTip = "Alphanumeric character string which inserts the favorite query string after expansion by pressing the ⇥ key."; ObjectID = "306";  */
"Alphanumeric character string which inserts the favorite query string after expansion by pressing the ⇥ key." = "Строка, состоящая из букв и цифр, которая вставляет запрос из закладок если после неё нажать на кнопку ⇥.";

